<?php

namespace Database\Seeders;

use App\Models\aboutUs;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AboutUsSedder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        aboutUs::create([
            'title_aboutus' => 'خدمات متميزة عبر كادر مؤهل (معادلة إسعاد المتعاملين) يضم 60 منفذ خدمة مجهز لخدمتكم',
            'title_our_mission'=> 'نسعي لتحقيق الأفضل دائما',
            'title_admin_word'=> 'معادلة إسعاد المتعاملين',
            'desc_aboutus'=> 'مركـز شـامل ومتخصـص فـي تقديـم كافـة الخدمـات الإداريـة وإلـى جانـب مجموعـة مـن الخدمـات الهامـة لعـدد مــن الجهــات الحكوميــة الاتحاديــة والمحليــة، وذلــك عبــر كادر مؤهــل مــن استشــاري ســعادة المتعامليــن مــن مواطنــي الدولــة والــذي يتــم تدريبهــم بواســطة فريــق مــن المستشــارين المؤهليــن وأصحــاب الخبــرات المتميزة في مجال تقديم الخدمات',
            'desc_our_mission'=> 'هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام "هنا يوجد محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من',
            'desc_admin_word'=> 'يحـرص مركـز يـاس علـى توفيـر بيئـة مضيافـة تعـزز ثقافـة السـعادة والإيجابيـة، انطلاقً ـا مـن إيماننـا بقدراتنـا
            المعــززة بمســاعينا الطموحــة، ومــن خــلال العمــل بــروح الفريــق الواحــد لإســعاد الموظــف والمتعامــل فــي
            المركز.
            حيــث إننــا نؤكــد التزامنــا التــام لتحقيــق هــذه المجموعــة الراقيــة مــن الأهــداف الطموحــة، ولتحقيــق ذلــك
            سـنوظف كافـة مواردنـا المتاحـة لدعـم كوادرنـا البشـرية التـي سـتقدم كافـة سـبل الدعـم والخدمـات لكافـة
            المتعامليـن، الأمـر الـذي سـوف يقـوم بإبهـار المتعامـل بتقديـم خدمـات تفـوق توقعاتـه بمـا يضمـن العـدل
            والمســاواة ضمــن تطبيــق الخدمــات الإلكترونيــة الســريعة التــي ســتمكننا مــن تحقيــق عناصــر الابتــكار
            والاستدامة.

            ً ولتحقيـق رؤيتنـا قمنـا بتطبيـق أعلـى معاييـر الجـودة فـي خدمـة العمـلاء ورصـد تطلعاتهـم المسـتمرة سـعيا
            إلــى إســعادهم مــن خــلال ترســيخ ثقــة المتعامليــن معنــا علــى النحــو الــذي ينســجم مــع تطلعــات قيادتنــا
            الحكيمة',
        ]);
    }
}
